# Створюємо функцію для роботи з кэшем

def caching_fibonachi():
    # Створюємо пам'ять для кэширування
    cache = {}

    # Функція для роботи з кэшем фібоначів
    def fib(n):
        # Перевіряємо чи є значення в кэші, якщо так, то повертаємо його, інакше робимо розрахунок і записуємо його в кэші
        # Якщо значення в кэші, то повертаємо його, інакше робимо розрахунок і записуємо його в кэші
        if n in cache:
            return cache[n]
        # Якщо n <= 0, то повертаємо 0 щоб не було мінусового числа
        if n <= 0: return 0
        if n == 1: return 1
        # Розраховуємо значення фібоначі і записуємо його в кэші
        cache[n] = fib(n - 1) + fib(n - 2)
        # Повертаємо значення фібоначі
        return cache[n]
    # Повертаємо внутрішню функцію 
    return fib

# Створюємо функцію для роботи з кэшем фібоначів
fib = caching_fibonachi()

# Виводимо результати роботи фібоначів
print(fib(10))
print(fib(20))
print(fib(10))