# Створюємо функцію для роботи з кэшем

def caching_fibonachi():
    cache = {} # Створюємо пам'ять для кэширування
    def fib(n): # Функція для роботи з кэшем фібоначів
        # Перевіряємо чи є значення в кэші, якщо так, то повертаємо його, інакше робимо розрахунок і записуємо його в кэші
        # Якщо значення в кэші, то повертаємо його, інакше робимо розрахунок і записуємо його в кэші
        if n in cache: return cache[n]
        if n <= 0: return 0 # Якщо n <= 0, то повертаємо 0 щоб не було мінусового числа
        if n == 1: return 1
        cache[n] = fib(n - 1) + fib(n - 2) # Розраховуємо значення фібоначі і записуємо його в кэші
        return cache[n] # Повертаємо значення фібоначі
    return fib # Повертаємо внутрішню функцію 


fib = caching_fibonachi() # Створюємо функцію для роботи з кэшем фібоначів

# Виводимо результати роботи фібоначів
print(fib(10))
print(fib(20))
print(fib(10))